#1.тест на удаление одной цепочки
#Программа подсчета удаляемых шариков
#Введите количество шариков и их цвета через пробел
#Пример: 5 1 3 3 3 2
#Введите данные: 5 1 3 3 3 2
#Результат: 3
#Хотите проверить другую цепочку? (да/нет): да
#Введите данные:
#2.тест на удаление нескольких цепочек
#Введите данные: 10 3 3 2 1 1 1 2 2 3 3
#Результат: 10
#3.тест на отсутствие цепочек
#Введите данные: 5 1 2 3 4 5
#Результат: 0
#4.тест на короткую цепочку(менее 3 шариков)
#Введите данные: 4 1 1 2 3
#Результат: 0
#5.тест на все шарики одного цвета
#Введите данные: 5 1 1 1 1 1
#Результат: 5
#6.тест на цепочку в конце списка
#Введите данные: 6 1 2 3 4 4 4
#Результат: 3
#7.тест на цепочку в начале списка
#Введите данные: 6 5 5 5 1 2 3
#Результат: 3

#8.тест на пустой ввод
#Введите данные:
#Ошибка: ввод не может быть пустым. Попробуйте снова.
#Введите данные:
#9.тест на неправильное количество шариков
#Введите данные: 4 1 2 2 3 3
#Ошибка: указано 4 шариков, но введено 5 цветов. Попробуйте снова.
#10.тест на ввод не целых чисел
#Введите данные: 4 a b c d
#Ошибка: все вводимые значения должны быть целыми числами. Попробуйте снова.
#11.тест на ввод шариков не от 0 до 9
#Введите данные: 3 11 45 22
#Ошибка: цвета шариков должны быть числами от 0 до 9. Попробуйте снова.
#12.тест
#Введите данные: 0
#Ошибка: нужно ввести как минимум количество шариков и один цвет. Попробуйте снова.
